app/controllers/api/v1/memberships_controller.rb

  def create
    membership = current_api_v1_user.memberships.build(event_id: params[:event_id])
    if membership.save
---
INSERT INTO `memberships` (`event_id`, `user_id`, `created_at`, `updated_at`) VALUES (28, 9, '2021-07-16 13:10:37.834400', '2021-07-16 13:10:37.834400')

  def destroy
    membership = Membership.find_by(event_id: params[:event_id], user_id: current_api_v1_user.id)
    if membership.destroy
---
SELECT `memberships`.* FROM `memberships` WHERE `memberships`.`event_id` = 27 AND `memberships`.`user_id` = 9 LIMIT 1
DELETE FROM `memberships` WHERE `memberships`.`id` = 2