api/app/controllers/api/v1/events_controller.rb

  def index
    # 参加人数を求めるサブクエリ
    participants_count_sql = Membership.select('count(id)').where('memberships.event_id = events.id').to_sql
    # EventsとUsersテーブルを内部結合して、必要なカラムをselect
    events = Event.joins(:user).select("events.*, users.name as organizer, (#{participants_count_sql}) as participants_count").order(id: 'DESC')
---
SELECT events.*, users.name as organizer FROM `events` INNER JOIN `users` ON `users`.`id` = `events`.`user_id` ORDER BY `events`.`id` DESC

  def show
    event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 28 LIMIT 1

  def search
    @keyword = params[:keyword]
    # 参加人数を求めるサブクエリ
    participants_count_sql = Membership.select('count(id)').where('memberships.event_id = events.id').to_sql

    if @keyword.present?
      @events = []
      @keyword.split(/[[:blank:]]+/).each do |keyword|
        next if keyword.blank?

        @events += Event.joins(:user)
                        .select("events.*, users.name as organizer, (#{participants_count_sql}) as participants_count")
                        .where('event_name LIKE(?) OR explanation LIKE(?)', "%#{keyword}%", "%#{keyword}%")
                        .order(id: 'DESC')
      end
      @events.uniq!
    else
      @events = Event.joins(:user).select("events.*, users.name as organizer, (#{participants_count_sql}) as participants_count").order(id: 'DESC')
---
SELECT events.*, users.name as organizer FROM `events` INNER JOIN `users` ON `users`.`id` = `events`.`user_id` WHERE (event_name LIKE('%バンアパ%') OR explanation LIKE('%バンアパ%'))
SELECT events.*, users.name as organizer FROM `events` INNER JOIN `users` ON `users`.`id` = `events`.`user_id` ORDER BY `events`.`id` DESC

  def create
    event = Event.new(event_params)
    if event.save
      render json: event, status: :ok
    else
      render json: event.errors
    end
    # 同時にメンバーシップも作成する
    latest_event = Event.last
    user = User.find(params[:user_id])
---
INSERT INTO `events` (`user_id`, `event_name`, `event_category`, `prefecture_id`, `venue`, `explanation`, `created_at`, `updated_at`, `start_date`, `end_date`, `image`) VALUES (9, 'events', 'test', 3, 'miyagi', 'yagi', '2021-07-16 10:03:32.000835', '2021-07-16 10:03:32.000835', '2021-07-17 10:00:00', '2021-07-18 12:00:00', 'sample.JPG')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def update
    event = Event.find(params[:id])
    if event.update!(event_params)
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 28 LIMIT 1
UPDATE `events` SET `events`.`start_date` = '2021-07-24 14:00:00', `events`.`end_date` = '2021-07-24 15:00:00', `events`.`updated_at` = '2021-07-20 05:30:34.780213' WHERE `events`.`id` = 24

  def destroy
    event = Event.find(params[:id])
    if event.destroy
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 30 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 30