api/app/controllers/api/v1/relationships_controller.rb

INSERT INTO `relationships` (`followed_id`, `follower_id`, `created_at`, `updated_at`) VALUES (9, 14, '2021-07-21 15:57:30.085606', '2021-07-21 15:57:30.085606')
---
  def create
    follow = current_api_v1_user.active_relationships.build(follower_id: params[:user_id])
    if follow.save!

DELETE FROM `relationships` WHERE `relationships`.`id` = 1
---
  def destroy
    follow = current_api_v1_user.active_relationships.find_by(follower_id: params[:user_id])
    if follow.destroy