api/app/controllers/api/v1/users_controller.rb

  def show
    user = User.find(params[:id])

    # 参加人数を求めるサブクエリ
    participants_count_sql = Membership.select('count(id)').where('memberships.event_id = events.id').to_sql

    organized_events = user.events.joins(:user).select("events.*, users.name as organizer, (#{participants_count_sql}) as participants_count").order(id: 'DESC')
    participating_events = user.participating_events.joins(:user)
                               .select("events.*, users.name as organizer, (#{participants_count_sql}) as participants_count")
                               .order(id: 'DESC')
    is_followed = user.followers.exists?(id: current_api_v1_user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'popdod.ds@yahoo.ne.jp' LIMIT 1
SELECT events.*, users.name as organizer FROM `events` INNER JOIN `memberships` ON `events`.`id` = `memberships`.`event_id` INNER JOIN `users` ON `users`.`id` = `events`.`user_id` WHERE `memberships`.`user_id` = 9
SELECT events.*, users.name as organizer FROM `events` INNER JOIN `memberships` ON `events`.`id` = `memberships`.`event_id` INNER JOIN `users` ON `users`.`id` = `events`.`user_id` WHERE `memberships`.`user_id` = 9 ORDER BY `events`.`id` DESC
SELECT 1 AS one FROM `users` INNER JOIN `relationships` ON `users`.`id` = `relationships`.`followed_id` WHERE `relationships`.`follower_id` = 14 AND `users`.`id` = 9 LIMIT 1
SELECT `events`.* FROM `events` INNER JOIN `memberships` ON `events`.`id` = `memberships`.`event_id` INNER JOIN `users` ON `users`.`id` = `events`.`user_id` WHERE `memberships`.`user_id` = 9
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def update
    user = User.find(params[:id])
    if user.update!(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
UPDATE `users` SET `users`.`name` = 'アオキ マサノリ', `users`.`self_introduction` = 'ギターとベースができます。よろしくお願いします。\nくるり好き。', `users`.`updated_at` = '2021-07-21 10:52:33.373977' WHERE `users`.`id` = 9

  def follows
    user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def followers
    user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1

  def follows_followers_count
    user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'popdod.ds@yahoo.ne.jp' LIMIT 1